---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.BendRadius
source: html/79f57488-64c6-1630-02a0-b80ceedf510b.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.BendRadius Property

The radius of all fillets, except hook fillets, in the Rebar shape.

## Syntax (C#)
```csharp
public double BendRadius { get; set; }
```

## Remarks
Inner radius, not centerline